# Rebar Is Crank Length Override Enabled Method

Source: https://www.revitapidocs.com/2026/ef56eb76-b344-bb68-c2de-3a6d0edf56c7.htm

---

| Rebar Is Crank Length Override Enabled Method |
| --- |

Returns true if the ability to override crank lengths is enabled for this rebar instance, false otherwise.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public bool IsCrankLengthOverrideEnabled()
```

```
Public Function IsCrankLengthOverrideEnabled As Boolean
```

```
public:
bool IsCrankLengthOverrideEnabled()
```

```
member IsCrankLengthOverrideEnabled : unit -> bool
```

#### Return Value

Boolean
Returns true if the ability to override crank lengths is enabled for this rebar instance, false otherwise. See Also

#### Reference

Rebar Class Autodesk.Revit.DB.Structure Namespace